IDEA StatiCa Open Model
TypeClassEvaluation Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Load of evaluation
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum TypeClassEvaluation
Public Enumeration TypeClassEvaluation
public enum class TypeClassEvaluation
Members
Member name | Value | Description
eLoadCase | 0 |  LoadCase
eLinCombi | 1 |  LinCombi
eNonLinCombi | 2 |  NonLinCombi
See Also
Reference
IdeaRS.OpenModel.Loading Namespace